app/controllers/inputs_controller.rb

SELECT "inputs".* FROM "inputs"
---
  def index
    @inputs = Input.all

INSERT INTO "inputs" ("email", "firstname", "lastname", "language", "proficiency", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @input = Input.new(input_params)

    respond_to do |format|
      if @input.save

DELETE FROM "inputs" WHERE "inputs"."id" = ?  [["id", 1]]
---
  def destroy
    @input.destroy

SELECT "inputs".* FROM "inputs" WHERE "inputs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_input
      @input = Input.find(params[:id])